## Making the connection

In [43]:
import mysql.connector as connection

## Showing Databases

In [44]:
try:
    # providing the connection 
    conn = connection.connect(host = 'localhost', 
        user = 'root', 
        passwd = 'Computer123@', 
        use_pure = True) 
    query = "SHOW DATABASES" 
    curs = conn.cursor() # creating the cursor for the connection 
    curs.execute(query) 
    print(curs.fetchall())
    conn.close()
except Exception as e:
    print(str(e))

[('Mytestdb',), ('information_schema',), ('mysql',), ('performance_schema',), ('sys',)]

## Checking the connection

In [3]:
conn.is_connected()

False

## Dropping Database

In [6]:
try:
    # providing the connection 
    conn = connection.connect(host = 'localhost', 
        user = 'root', 
        passwd = 'Computer123@', 
        use_pure = True) 
    query = "DROP DATABASE Mytestdb" 
    curs = conn.cursor() # creating the cursor for the connection 
    curs.execute(query) 
    # print(curs.fetchall())
    conn.close()
except Exception as e:
    print(str(e))

## Creating new database

In [8]:
# CREATE DATABASE mydb 
conn = connection.connect(host = 'localhost',
                          user = 'root',
                         passwd = 'Computer123@', 
                         use_pure = True) 
curs = conn.cursor() 
curs.execute('CREATE DATABASE Mytestdb') 
conn.close()

In [9]:
# checking 
conn = connection.connect(host = 'localhost', user = 'root', 
                          passwd = 'Computer123@',use_pure = True)
curs = conn.cursor()
curs.execute('show databases')
print(curs.fetchall())
conn.close()

[('Mytestdb',), ('information_schema',), ('mysql',), ('performance_schema',), ('sys',)]

## Creating a table inside the database

In [10]:
test_db_conn = connection.connect(host = 'localhost',user = 'root', 
                                  passwd = 'Computer123@',
                         database = 'Mytestdb',use_pure = True)
curs = test_db_conn.cursor() 
statement = """
CREATE TABLE StudentDetails(studentId INT(10) AUTO_INCREMENT PRIMARY KEY,
                            firstName VARCHAR(20), 
                            lastName VARCHAR(20), 
                            registrationDate DATE, 
                            class VARCHAR(20), 
                            section VARCHAR(10))
"""
curs.execute(statement)

In [11]:
test_db_conn.close()

In [12]:
# checking the tables 
test_db_conn = connection.connect(host = 'localhost',user = 'root', 
                                  passwd = 'Computer123@',
                         database = 'Mytestdb',use_pure = True)
curs = test_db_conn.cursor() 
statement  = "select * from StudentDetails" 
curs.execute(statement)
print(curs.fetchall())
test_db_conn.close()

[]

## Inserting records into database table

In [13]:
test_db_conn = connection.connect(host = 'localhost',user = 'root', 
                                  passwd = 'Computer123@',
                         database = 'Mytestdb',use_pure = True)
curs = test_db_conn.cursor()
statement = """
        INSERT INTO StudentDetails VALUES
        ('1132', 'Thomas', 'Reji','2020-12-21', 'pg', 'Four') 
"""
curs.execute(statement)
test_db_conn.commit() 
test_db_conn.close()

In [14]:
# selecting the records
test_db_conn = connection.connect(host = 'localhost',user = 'root', 
                                  passwd = 'Computer123@',
                         database = 'Mytestdb',use_pure = True)
curs = test_db_conn.cursor() 
statement  = "select * from StudentDetails" 
curs.execute(statement)
print(curs.fetchall())
test_db_conn.close()

[(1132, 'Thomas', 'Reji', datetime.date(2020, 12, 21), 'pg', 'Four')]

In [15]:
test_db_conn = connection.connect(host = 'localhost',user = 'root', 
                                  passwd = 'Computer123@',
                         database = 'Mytestdb',use_pure = True)
curs = test_db_conn.cursor()
statement1 = """
        INSERT INTO StudentDetails VALUES
        ('1133', 'Maria', 'Thomas','2020-11-20', 'pg', 'Four')
        """
statement2= """
        INSERT INTO StudentDetails VALUES
        ('1134', 'steve', 'martin','2020-08-25', 'ug', 'Second')
"""
statement3 = """
        INSERT INTO StudentDetails VALUES
        ('1135', 'Colins', 'James','2020-11-20', 'pg', 'First')        
"""
curs.execute(statement1)
curs.execute(statement2)
curs.execute(statement3)

test_db_conn.commit() 
test_db_conn.close()

## Getting all the inserted rows

In [16]:
# selecting the records
test_db_conn = connection.connect(host = 'localhost',user = 'root', 
                                  passwd = 'Computer123@',
                         database = 'Mytestdb',use_pure = True)
curs = test_db_conn.cursor() 
statement  = "select * from StudentDetails" 
curs.execute(statement)
print(curs.fetchall())
test_db_conn.close()

[(1132, 'Thomas', 'Reji', datetime.date(2020, 12, 21), 'pg', 'Four'), (1133, 'Maria', 'Thomas', datetime.date(2020, 11, 20), 'pg', 'Four'), (1134, 'steve', 'martin', datetime.date(2020, 8, 25), 'ug', 'Second'), (1135, 'Colins', 'James', datetime.date(2020, 11, 20), 'pg', 'First')]

In [17]:
test_db_conn = connection.connect(host = 'localhost',user = 'root', 
                                  passwd = 'Computer123@',
                         database = 'Mytestdb',use_pure = True)
curs = test_db_conn.cursor() 
statement  = "select * from StudentDetails" 
curs.execute(statement)
for i in curs.fetchall():
    print(i)
test_db_conn.close()

(1132, 'Thomas', 'Reji', datetime.date(2020, 12, 21), 'pg', 'Four')
(1133, 'Maria', 'Thomas', datetime.date(2020, 11, 20), 'pg', 'Four')
(1134, 'steve', 'martin', datetime.date(2020, 8, 25), 'ug', 'Second')
(1135, 'Colins', 'James', datetime.date(2020, 11, 20), 'pg', 'First')

## Getting data in tabular format

In [18]:
import pandas as pd

In [23]:
test_db_conn = connection.connect(host = 'localhost',user = 'root', 
                                  passwd = 'Computer123@',
                         database = 'Mytestdb',use_pure = True)
pd.read_sql("select * from StudentDetails", test_db_conn)

   studentId firstName lastName registrationDate class section
0       1132    Thomas     Reji       2020-12-21    pg    Four
1       1133     Maria   Thomas       2020-11-20    pg    Four
2       1134     steve   martin       2020-08-25    ug  Second
3       1135    Colins    James       2020-11-20    pg   First

## Reading the file and dump it into the database

### Reading the data using pandas

In [24]:
glass_data = pd.read_csv('glass.csv')
glass_data

     index       RI     Na    Mg    Al     Si     K    Ca    Ba   Fe  Class
0        1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.00  0.0      1
1        2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.00  0.0      1
2        3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.00  0.0      1
3        4  1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.00  0.0      1
4        5  1.51742  13.27  3.62  1.24  73.08  0.55  8.07  0.00  0.0      1
..     ...      ...    ...   ...   ...    ...   ...   ...   ...  ...    ...
209    210  1.51623  14.14  0.00  2.88  72.61  0.08  9.18  1.06  0.0      7
210    211  1.51685  14.92  0.00  1.99  73.06  0.00  8.40  1.59  0.0      7
211    212  1.52065  14.36  0.00  2.02  73.42  0.00  8.44  1.64  0.0      7
212    213  1.51651  14.38  0.00  1.94  73.61  0.00  8.48  1.57  0.0      7
213    214  1.51711  14.23  0.00  2.08  73.36  0.00  8.62  1.67  0.0      7

[214 rows x 11 columns]

In [26]:
# setting the connection 
test_db_conn

### Creating the table for dumping the glass data

In [33]:
curs = test_db_conn.cursor() 
query = """CREATE TABLE IF NOT EXISTS GlassData (
                    Index_Number INT(10),
                    RI float(10,5),
                    Na float(10,5),
                    Mg float(10,5),
                    Al float(10,5),
                    Si float(10,5), 
                    K float(10,5), 
                    Ca float(10,5), 
                    Ba float(10,5), 
                    Fe float(10,5), 
                    Class INT(5)
                    ) """
curs.execute(query)

In [31]:
# glass_data.to_sql(name = 'glassDetails',con = test_db_conn)
glass_data.dtypes

index      int64
RI       float64
Na       float64
Mg       float64
Al       float64
Si       float64
K        float64
Ca       float64
Ba       float64
Fe       float64
Class      int64
dtype: object

In [40]:
import csv 
with open ('glass.csv', 'r') as f:
    next(f)
    glass_data = csv.reader(f, delimiter = '\n')
    for line in enumerate(glass_data):
        for list_ in line[1]:
            curs.execute('INSERT INTO GlassData values ({values})'.format(values=(list_)))
test_db_conn.commit()
curs.close()
test_db_conn.close()

## reading the uploaded glass data from the databae

In [41]:
test_db_conn = connection.connect(host = 'localhost',user = 'root', 
                                  passwd = 'Computer123@',
                         database = 'Mytestdb',use_pure = True)

In [42]:
pd.read_sql('select * from GlassData',test_db_conn)

,Index_Number,RI,Na,Mg,Al,Si,K,Ca,Ba,Fe,Class
0,1,1.52101,13.64,4.49,1.10,71.78,0.06,8.75,0.00,0.0,1
1,2,1.51761,13.89,3.60,1.36,72.73,0.48,7.83,0.00,0.0,1
2,3,1.51618,13.53,3.55,1.54,72.99,0.39,7.78,0.00,0.0,1
3,4,1.51766,13.21,3.69,1.29,72.61,0.57,8.22,0.00,0.0,1
4,5,1.51742,13.27,3.62,1.24,73.08,0.55,8.07,0.00,0.0,1
...,...,...,...,...,...,...,...,...,...,...,...
209,210,1.51623,14.14,0.00,2.88,72.61,0.08,9.18,1.06,0.0,7
210,211,1.51685,14.92,0.00,1.99,73.06,0.00,8.40,1.59,0.0,7
211,212,1.52065,14.36,0.00,2.02,73.42,0.00,8.44,1.64,0.0,7
212,213,1.51651,14.38,0.00,1.94,73.61,0.00,8.48,1.57,0.0,7
213,214,1.51711,14.23,0.00,2.08,73.36,0.00,8.62,1.67,0.0,7

## Delete table

In [47]:
test_db_conn = connection.connect(host = 'localhost',user = 'root', 
                                  passwd = 'Computer123@',
                         database = 'Mytestdb',use_pure = True)

statement = "DELETE FROM StudentDetails WHERE firstName = 'Colins'"
curs = test_db_conn.cursor() 
curs.execute(statement)
test_db_conn.commit()
test_db_conn.close()

In [48]:
test_db_conn = connection.connect(host = 'localhost',user = 'root', 
                                  passwd = 'Computer123@',
                         database = 'Mytestdb',use_pure = True)
curs = test_db_conn.cursor() 
statement  = "select * from StudentDetails" 
curs.execute(statement)
for i in curs.fetchall():
    print(i)
test_db_conn.close()

(1132, 'Thomas', 'Reji', datetime.date(2020, 12, 21), 'pg', 'Four')
(1133, 'Maria', 'Thomas', datetime.date(2020, 11, 20), 'pg', 'Four')
(1134, 'steve', 'martin', datetime.date(2020, 8, 25), 'ug', 'Second')

## Update the values

In [50]:
test_db_conn = connection.connect(host = 'localhost',user = 'root', 
                                  passwd = 'Computer123@',
                         database = 'Mytestdb',use_pure = True)
curs = test_db_conn.cursor() 
statement = """
        UPDATE StudentDetails SET firstName = 'Merin' WHERE studentId = 1132
"""
curs.execute(statement)
test_db_conn.commit() 
test_db_conn.close()

In [51]:
test_db_conn = connection.connect(host = 'localhost',user = 'root', 
                                  passwd = 'Computer123@',
                         database = 'Mytestdb',use_pure = True)
curs = test_db_conn.cursor() 
statement  = "select * from StudentDetails" 
curs.execute(statement)
for i in curs.fetchall():
    print(i)
test_db_conn.close()

(1132, 'Merin', 'Reji', datetime.date(2020, 12, 21), 'pg', 'Four')
(1133, 'Maria', 'Thomas', datetime.date(2020, 11, 20), 'pg', 'Four')
(1134, 'steve', 'martin', datetime.date(2020, 8, 25), 'ug', 'Second')